app/controllers/products_controller.rb

INSERT INTO "products" ("name", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "demo"], ["price", 10.0], ["created_at", "2016-01-22 18:13:07.891915"], ["updated_at", "2016-01-22 18:13:07.891915"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|

      if @product.save